export const MasadighMojData = {
    telegram : {
        title : 'شبکه خبر',
        dec : 'بعد فرمان آقا که باید به مردم مظلوم لبنان و غزه پول و کمک بفرستیم، پویش راه انداختیم تو کشور تا پول جمع کنیم!🔴ویدیوی جدید از الهام صفوی‌زاده مجری سابق صداوسیما تو استخر ویلای شخصیش در شمال کشور😶' 
    },
    twitter : {
        title : 'بدون تایتل',
        dec : 'باید بیشتر مراقب نفوذ در #صداوسیما باشیم!',
    },
    dakheli : {
        title : 'بدون تایتل',
        dec : 'پشت‌ پرده بی‌قانونی‌‌ها در نمایش‌خانگی دبیر شورای نظارت بر صداوسیما در گفت‌وگو با تسنیم: 🔹مهم‌ترین ضعف ساترا از نظر من، فقدان قانون است. ما به صدا و سیما اعلام کرده‌ایم که ادامه این وضعیت به نفع آن‌ها نخواهد بود. 🔹فقدان قانون باعث شده نه ساترا به‌خوبی می‌داند چه اختیاری دارد و نه پلتفرم‌ها خود را ملزم به رعایت اصول و قوانین می‌دانند. 🔹حق پخش تلویزیونی مسابقات ورزشی را من به جریان انداختم. ما بارها اعلام کردیم که ورزش و صداوسیما هیچ‌گونه قانونی ارائه نکرده‌اند. قرار بود لایحه‌ای به مجلس ارائه دهند، اما این کار انجام نشد. 🔹نیاز به سازمانی مشابه «آفکام» داریم. این سازمان باید بتواند مجوزها را صادر کند و در عین حال از وقوع تعارض و تضاد منافع جلوگیری کند.',
    }
}

